{
   "id":"tt2488496",
   "type":"title",
   "title":null,
   "year":null,
   "description":"30 yars after the defeat of Darth Vader and the Empire, Rey, a scavenger from the planet Jakku, finds a BB-8 droid that knows the whereabouts of the long lost Luke Skywalker. Rey, as well as a rogue stormtrooper and two smugglers, are thrown into the middle of a battle between the Resistance and the daunting legions of the First Order.                Written byNoah White",
   "certificate":"",
   "duration":"2h 18min",
   "released":"2015-12-18",
   "cast":[
      "Harrison Ford",
      "Mark Hamill",
      "Carrie Fisher",
      "Adam Driver",
      "Daisy Ridley",
      "John Boyega",
      "Oscar Isaac",
      "Lupita Nyong'o",
      "Andy Serkis",
      "Domhnall Gleeson",
      "Anthony Daniels",
      "Max von Sydow",
      "Peter Mayhew",
      "Gwendoline Christie",
      "Joonas Suotamo"
   ],
   "genres":[
      "action",
      "adventure",
      "fantasy",
      "sci-fi"
   ],
   "directors":[

   ],
   "writers":[
   ],
   "image":"http://ia.media-imdb.com/images/M/MV5BOTAzODEzNDAzMl5BMl5BanBnXkFtZTgwMDU1MTgzNzE@._V1_UX182_CR0,0,182,268_AL_.jpg",
   "review":{
      "text":"Star Wars to me has always been about imagination.There&#x27;s a lot that has been said about George Lucas in the last forty years, but there&#x27;s one thing that can&#x27;t be denied: he had imagination.JJ Abrams however does not and it shows in The Force Awakens. Besides the plot, which isn&#x27;t original to say the least and has a lot of questionable elements, the visual design is very bland and derivative. The actual look and feel of the film reminds more of JJ&#x27;s Star Trek films than of the original Star Wars trilogy, although luckily there are only a handful of lens flares to be seen.Even the music sounds uninspired. Which is a shame since the music was always one of the strongest parts of Star Wars.All in all it&#x27;s an extremely average film, which would have been fine if it wasn&#x27;t Star Wars. Star Wars is about pushing the limits and the only thing that was pushed here is your hype button.The prequel trilogy was a misstep in a lot of aspects, but at least George tried to innovate and create something new. The Force Awakens however is a big step backwards.",
      "rating":null
   },
   "Title":"Star Wars: The Force Awakens",
   "Year":"2015",
   "Rated":"PG-13",
   "Released":"18 Dec 2015",
   "Runtime":"138 min",
   "Genre":"Action, Adventure, Fantasy",
   "Director":"J.J. Abrams",
   "Writer":"Lawrence Kasdan, J.J. Abrams, Michael Arndt, George Lucas (based on characters created by)",
   "Actors":"Harrison Ford, Mark Hamill, Carrie Fisher, Adam Driver",
   "Plot":"Three decades after the defeat of the Galactic Empire, a new threat arises. The First Order attempts to rule the galaxy and only a ragtag group of heroes can stop them, along with the help of the Resistance.",
   "Language":"English",
   "Country":"USA",
   "Awards":"Nominated for 5 Oscars. Another 48 wins & 104 nominations.",
   "Poster":"http://ia.media-imdb.com/images/M/MV5BOTAzODEzNDAzMl5BMl5BanBnXkFtZTgwMDU1MTgzNzE@._V1_SX300.jpg",
   "Metascore":"81",
   "imdbRating":"8.2",
   "imdbVotes":"575,439",
   "imdbID":"tt2488496",
   "Type":"movie",
   "Response":"True"
}
