{
	"status": "success",
	"code": 200,
	"message": "ok",
	"data": {
		"id": "tt2488496",
		"type": "title",
		"title": null,
		"year": null,
		"description": "30 years after the defeat of Darth Vader and the Empire, Rey, a scavenger from the planet Jakku, finds a BB-8 droid that knows the whereabouts of the long lost Luke Skywalker. Rey, as well as a rogue stormtrooper and two smugglers, are thrown into the middle of a battle between the Resistance and the daunting legions of the First Order.                Written byNoah White",
		"certificate": "",
		"duration": "2h 18min",
		"released": "2015-12-18",
		"cast": [
			"Harrison Ford",
			"Mark Hamill",
			"Carrie Fisher",
			"Adam Driver",
			"Daisy Ridley",
			"John Boyega",
			"Oscar Isaac",
			"Lupita Nyong'o",
			"Andy Serkis",
			"Domhnall Gleeson",
			"Anthony Daniels",
			"Max von Sydow",
			"Peter Mayhew",
			"Gwendoline Christie",
			"Joonas Suotamo"
		],
		"genres": [
			"action",
			"adventure",
			"fantasy",
			"sci-fi"
		],
		"directors": [],
		"writers": [],
		"image": "http://ia.media-imdb.com/images/M/MV5BOTAzODEzNDAzMl5BMl5BanBnXkFtZTgwMDU1MTgzNzE@._V1_UX182_CR0,0,182,268_AL_.jpg",
		"review": {
			"text": "Take a look at the rating details for this movie and you'll see that the highest ratings are coming from the youngest age group (18 and younger) while the lowest ratings are from the highest age group (45+). This is really all you need to know about this movie.I understand Disney marketing the movie by saying that "every generation has a story," but it appears that this generation's story is about blatant plagiarism and a sad, obvious attempt at political correctiveness. I don't mind a black male lead, I don't mind a female lead, but every damn movie these days is seemingly directed at this point. Twilight, Hunger Games, Fifth Wave. Girl Power, right? I understand, but then again, I don't understand.This movie is nothing more than a pc rehash of the original trilogy-- meant to trick the innocent youth who haven't seen them--while at the same time giving the finger to Lucas and those who saw the originals and watched in helpless horror as he was shoved to the curb. It's ironic, the people who Lucas made movies about--the Nazis and the subsequent Empire--have managed to buy out his creation and repackage it for a pop-culture nation so delusion it's seeing the world through a brown filter. I understand, but then again, I don't understand.After seeing this the first time, I went back for a second viewing to see if I was being too harsh, maybe I missed something, it's a fast-paced movie after all. And I did miss several things from the first viewing, but those things I missed (see any of the thousands of 1-star reviews) only led me to hate this film even more. Abrams did the same thing with Star Trek, turning Khan into a white, deep-voiced menace. Khan Noonien Singh, a white man. It's all for profit and further proof that Hollywood is bankrupt of both creativity and money. Morality? Well, they've been devoid of that from the start.I suppose I'll be labeled a white bigot woman hater from this review, but that's the way the world works nowadays. Don't dare question the pc pop-culture nation, or else face the wrath of, well...just wait and they'll reveal themselves. Don't dare question anything, just accept it as reality and never question it.Having said that, I will see the second and third movies from this trilogy, either online or in theatres. Call it curiosity or just a narcissistic necessity. Either way, I understand, but then again, I don't understand.",
			"rating": "1/10"
		}
	}
}
